## 1 Reasing and Writing Data in the Text Format

<img src='img/6_1_1.png'>

In [7]:
import pandas as pd

In [8]:
import numpy as np

In [4]:
!cat examples/ex1.csv  # ! indicates the following is a shell command

a,b,c,d,message
1,2,3,4,hello
5,6,7,8,world
9,10,11,12,foo

In [9]:
df = pd.read_csv('examples/ex1.csv')

In [10]:
df

   a   b   c   d message
0  1   2   3   4   hello
1  5   6   7   8   world
2  9  10  11  12     foo

It's same to:

In [11]:
pd.read_table('examples/ex1.csv', sep=',')

   a   b   c   d message
0  1   2   3   4   hello
1  5   6   7   8   world
2  9  10  11  12     foo

Read file withoud header

In [12]:
pd.read_csv('examples/ex1.csv', header=None)

   0   1   2   3        4
0  a   b   c   d  message
1  1   2   3   4    hello
2  5   6   7   8    world
3  9  10  11  12      foo

Specify header names yourself:

In [14]:
pd.read_csv('examples/ex2.csv', names=['a', 'b', 'c', 'd', 'message'])

   a   b   c   d message
0  1   2   3   4   hello
1  5   6   7   8   world
2  9  10  11  12     foo

Use message column as the index

In [15]:
pd.read_csv('examples/ex2.csv', names=['a', 'b', 'c', 'd', 'message'], index_col='message')

         a   b   c   d
message
hello    1   2   3   4
world    5   6   7   8
foo      9  10  11  12

Form a hierarchical index from multiple columns, pass a list of column numbers or names

In [16]:
!cat examples/csv_mindex.csv

key1,key2,value1,value2
one,a,1,2
one,b,3,4
one,c,5,6
one,d,7,8
two,a,9,10
two,b,11,12
two,c,13,14
two,d,15,16

In [17]:
parsed = pd.read_csv('examples/csv_mindex.csv', index_col=['key1', 'key2'])

In [19]:
parsed

           value1  value2
key1 key2
one  a          1       2
     b          3       4
     c          5       6
     d          7       8
two  a          9      10
     b         11      12
     c         13      14
     d         15      16

Pass a regular expression as a delimiter for read_table

In [20]:
list(open('examples/ex3.txt'))

['            A         B         C\n',
 'aaa -0.264438 -1.026059 -0.619500\n',
 'bbb  0.927272  0.302904 -0.032399\n',
 'ccc -0.264273 -0.386314 -0.217601\n',
 'ddd -0.871858 -0.348382  1.100491\n']

In [21]:
result = pd.read_table('examples/ex3.txt', sep='\s+')

In [22]:
result

            A         B         C
aaa -0.264438 -1.026059 -0.619500
bbb  0.927272  0.302904 -0.032399
ccc -0.264273 -0.386314 -0.217601
ddd -0.871858 -0.348382  1.100491

Skip specific rows of a file with ___skiprows___

In [23]:
!cat examples/ex4.csv

# hey!
a,b,c,d,message
# just wanted to make things more difficult for you
# who reads CSV files with computers, anyway?
1,2,3,4,hello
5,6,7,8,world
9,10,11,12,foo

In [24]:
pd.read_csv('examples/ex4.csv', skiprows=[0, 2, 3])

   a   b   c   d message
0  1   2   3   4   hello
1  5   6   7   8   world
2  9  10  11  12     foo

Handle missing values

In [25]:
!cat examples/ex5.csv

something,a,b,c,d,message
one,1,2,3,4,NA
two,5,6,,8,world
three,9,10,11,12,foo

In [26]:
result = pd.read_csv('examples/ex5.csv')

In [27]:
result

  something  a   b     c   d message
0       one  1   2   3.0   4     NaN
1       two  5   6   NaN   8   world
2     three  9  10  11.0  12     foo

In [28]:
pd.isnull(result)

   something      a      b      c      d  message
0      False  False  False  False  False     True
1      False  False  False   True  False    False
2      False  False  False  False  False    False

***na_values*** option can take either a list or set of strings to consider missing values:

In [29]:
pd.read_csv('examples/ex5.csv', na_values=['foo'])

  something  a   b     c   d message
0       one  1   2   3.0   4     NaN
1       two  5   6   NaN   8   world
2     three  9  10  11.0  12     NaN

Different NA sentinels can be specified for each column in a dict

In [30]:
sentinels = {'message': ['foo', 'NA'], 'something': ['two']}

In [31]:
pd.read_csv('examples/ex5.csv', na_values=sentinels)

  something  a   b     c   d message
0       one  1   2   3.0   4     NaN
1       NaN  5   6   NaN   8   world
2     three  9  10  11.0  12     NaN

### 1.1 Reading Text Files in Pieces

When processing very large files, you may need to read in a small piece of file.

Making the pandas display setting more compact

In [32]:
pd.options.display.max_rows = 10

In [36]:
result = pd.read_csv('examples/ex6.csv')

In [37]:
result

           one       two     three      four key
0     0.467976 -0.038649 -0.295344 -1.824726   L
1    -0.358893  1.404453  0.704965 -0.200638   B
2    -0.501840  0.659254 -0.421691 -0.057688   G
3     0.204886  1.074134  1.388361 -0.982404   R
4     0.354628 -0.133116  0.283763 -0.837063   Q
...        ...       ...       ...       ...  ..
9995  2.311896 -0.417070 -1.409599 -0.515821   L
9996 -0.479893 -0.650419  0.745152 -0.646038   E
9997  0.523331  0.787112  0.486066  1.093156   K
9998 -0.362559  0.598894 -1.843201  0.887292   G
9999 -0.096376 -1.012999 -0.657431 -0.573315   0

[10000 rows x 5 columns]

Reading only a small number of rows

In [39]:
pd.read_csv('examples/ex6.csv', nrows=5)

        one       two     three      four key
0  0.467976 -0.038649 -0.295344 -1.824726   L
1 -0.358893  1.404453  0.704965 -0.200638   B
2 -0.501840  0.659254 -0.421691 -0.057688   G
3  0.204886  1.074134  1.388361 -0.982404   R
4  0.354628 -0.133116  0.283763 -0.837063   Q

To read a file in pieces, specify a ___chunksize___ as a number of rows

In [51]:
chunker = pd.read_csv('examples/ex6.csv', chunksize=1000)

In [52]:
chunker

Iterating over the returned object

In [53]:
tot = pd.Series([])

In [54]:
for piece in chunker:
    tot = tot.add(piece['key'].value_counts(), fill_value=0)

In [59]:
tot = tot.sort_values(ascending=False)

In [60]:
tot[:10]

E    368.0
X    364.0
L    346.0
O    343.0
Q    340.0
M    338.0
J    337.0
F    335.0
K    334.0
H    330.0
dtype: float64

### 1.2 Writing Data to Text Format

In [61]:
data = pd.read_csv('examples/ex5.csv')

In [62]:
data

  something  a   b     c   d message
0       one  1   2   3.0   4     NaN
1       two  5   6   NaN   8   world
2     three  9  10  11.0  12     foo

In [63]:
data.to_csv('examples/out.csv')

In [64]:
!cat examples/out.csv

,something,a,b,c,d,message
0,one,1,2,3.0,4,
1,two,5,6,,8,world
2,three,9,10,11.0,12,foo

Writing to sys.stdout so it prints the text result to the console

In [66]:
import sys

In [67]:
data.to_csv(sys.stdout, sep='|')

|something|a|b|c|d|message
0|one|1|2|3.0|4|
1|two|5|6||8|world
2|three|9|10|11.0|12|foo

Missing values appear as empty in default. Can be specified

In [68]:
data.to_csv(sys.stdout, na_rep='NULL')

,something,a,b,c,d,message
0,one,1,2,3.0,4,NULL
1,two,5,6,NULL,8,world
2,three,9,10,11.0,12,foo

Disable row and column labels in output file

In [69]:
data.to_csv(sys.stdout, index=False, header=False)

one,1,2,3.0,4,
two,5,6,,8,world
three,9,10,11.0,12,foo

Only write a subset of the columns, and in choosing order

In [70]:
data.to_csv(sys.stdout, index=False, columns=['b', 'c', 'a'])

b,c,a
2,3.0,1
6,,5
10,11.0,9

Series also has a to_csv method

In [71]:
dates = pd.date_range('1/1/2000', periods=7)

In [72]:
ts = pd.Series(np.arange(7), index=dates)

In [73]:
ts.to_csv(sys.stdout)

2000-01-01,0
2000-01-02,1
2000-01-03,2
2000-01-04,3
2000-01-05,4
2000-01-06,5
2000-01-07,6

### 1.3 Working with Delimited Formats

Process the data file line-by-line to deal with malforemed lines

In [74]:
!cat examples/ex7.csv

"a","b","c"
"1","2","3"
"1","2","3"

In [75]:
import csv

In [104]:
f = open('examples/ex7.csv')

In [96]:
reader = csv.reader(f)

In [97]:
for line in reader:
    # Do some manipulation
    print line

['a', 'b', 'c']
['1', '2', '3']
['1', '2', '3']

Using ___with___

In [99]:
with open('examples/ex7.csv') as f:
    lines = list(csv.reader(f))
    # Split the header line and the data lines
    header, values = lines[0], lines[1:]
    # Create a dictionary of data columns
    data_dict = {col: val for col, val in zip(header, zip(*values))}

In [100]:
data_dict

{'a': ('1', '1'), 'b': ('2', '2'), 'c': ('3', '3')}

Define a subclass of csv.Dialect to pass different parameters to csv.reader

In [102]:
class my_dialect(csv.Dialect):
    lineterminator = '\n'
    delimiter = ';'
    quotechar = '"'
    quoting = csv.QUOTE_MINIMAL

In [106]:
reader = csv.reader(f, dialect=my_dialect)

Or giving dialect parameters as keywords

In [107]:
reader = csv.reader(f, delimiter='|')

Writing delimited files manually. csv.writer accepts an open, writable file object and the same dialect and format options as csv.reader

### 1.4 JSON Data

In [108]:
obj = """
    {"name": "Wes",
     "places_lived": ["United States", "Spain", "Germany"],
     "pet": null,
     "siblings": [{"name": "Scott", "age": 30, "pets": ["Zeus", "Zuko"]},
                  {"name": "Katie", "age": 38,
                   "pets": ["Sixes", "Stache", "Cisco"]}]
} """

To convert a JSON strings to Python form, use ___json.loads___

In [109]:
import json

In [110]:
result = json.loads(obj)

In [111]:
result

{u'name': u'Wes',
 u'pet': None,
 u'places_lived': [u'United States', u'Spain', u'Germany'],
 u'siblings': [{u'age': 30, u'name': u'Scott', u'pets': [u'Zeus', u'Zuko']},
  {u'age': 38, u'name': u'Katie', u'pets': [u'Sixes', u'Stache', u'Cisco']}]}

In [112]:
type(result)

dict

___json.dumps___ converts a Python object back to JSON

In [113]:
asjson = json.dumps(result)

In [114]:
asjson

'{"pet": null, "siblings": [{"age": 30, "name": "Scott", "pets": ["Zeus", "Zuko"]}, {"age": 38, "name": "Katie", "pets": ["Sixes", "Stache", "Cisco"]}], "name": "Wes", "places_lived": ["United States", "Spain", "Germany"]}'

In [115]:
type(asjson)

str

To convert a JSON object or list of objects to a DataFrame, you can pass a list of dicts to the DataFrame constructor and select a subset of the data fields.

In [116]:
siblings = pd.DataFrame(result['siblings'], columns = ['name', 'age'])

In [117]:
siblings

    name  age
0  Scott   30
1  Katie   38

The ***pandas.read_json*** can convert JSON datasets in specific arrangements into a Series or DataFrame

In [119]:
!cat examples/example.json

[{"a": 1, "b": 2, "c": 3},
 {"a": 4, "b": 5, "c": 6},
 {"a": 7, "b": 8, "c": 9}]

In [121]:
data = pd.read_json('examples/example.json')

In [122]:
data

   a  b  c
0  1  2  3
1  4  5  6
2  7  8  9

To export data from pandas to JSON, you can use the ***to_json***

In [124]:
print(data.to_json())

{"a":{"0":1,"1":4,"2":7},"b":{"0":2,"1":5,"2":8},"c":{"0":3,"1":6,"2":9}}

In [125]:
data.to_json(orient='records')

'[{"a":1,"b":2,"c":3},{"a":4,"b":5,"c":6},{"a":7,"b":8,"c":9}]'

For an extended sample of reading and manipulating JSON data, see example in Chapter 7

### 1.5 XML and HTML: Web Scraping

Libraries for reading and writing data in HTML and XML: lxml, Beautiful Soup, and html5lib. While lxml is comparatively much faster in general, the other two can better handle malformed files

pandas has a built-in function, `read_html`, to automatically parse tables out of HTML files as DataFrame object.

The pandas.read_html attempts to parse all tabular data contained within `<table>` tag, and returns a list of DataFrame objects

In [126]:
tables = pd.read_html('examples/fdic_failed_bank_list.html')

In [127]:
len(tables)

1

In [128]:
failures = tables[0]

In [129]:
failures

,Bank Name,City,ST,CERT,Acquiring Institution,Closing Date,Updated Date
0,Allied Bank,Mulberry,AR,91,Today's Bank,"September 23, 2016","November 17, 2016"
1,The Woodbury Banking Company,Woodbury,GA,11297,United Bank,"August 19, 2016","November 17, 2016"
2,First CornerStone Bank,King of Prussia,PA,35312,First-Citizens Bank & Trust Company,"May 6, 2016","September 6, 2016"
3,Trust Company Bank,Memphis,TN,9956,The Bank of Fayette County,"April 29, 2016","September 6, 2016"
4,North Milwaukee State Bank,Milwaukee,WI,20364,First-Citizens Bank & Trust Company,"March 11, 2016","June 16, 2016"
...,...,...,...,...,...,...,...
542,"Superior Bank, FSB",Hinsdale,IL,32646,"Superior Federal, FSB","July 27, 2001","August 19, 2014"
543,Malta National Bank,Malta,OH,6629,North Valley Bank,"May 3, 2001","November 18, 2002"
544,First Alliance Bank & Trust Co.,Manchester,NH,34264,Southern New Hampshire Bank & Trust,"February 2, 2001","February 18, 2003"
545,National State Bank of Metropolis,Metropolis,IL,3815,Banterra Bank of Marion,"December 14, 2000","March 17, 2005"
546,Bank of Honolulu,Honolulu,HI,21029,Bank of the Orient,"October 13, 2000","March 17, 2005"

Computing the number of bank failures by year

In [130]:
close_timestamps = pd.to_datetime(failures['Closing Date'])

In [133]:
close_timestamps.dt.year.value_counts()

2010    157
2009    140
2011     92
2012     51
2008     25
       ...
2004      4
2001      4
2007      3
2003      3
2000      2
Name: Closing Date, Length: 15, dtype: int64

___Parsing XML with lxml.objectify___

Using objectify to parse the file and get a reference to the root node of the XML file with `getroot`

In [134]:
from lxml import objectify

In [135]:
parsed = objectify.parse(open('datasets/mta_perf/Performance_MNR.xml'))

In [137]:
root = parsed.getroot()

Check the original book or the documents of the libary for more details

## 2 Binary Data Formats

- Using Python's built-in `pickle` serialization to store data efficiently in binary format (not recommended as a long-ter storage format)
- HDF5. Intended for storing large quantities of scientific array data. Availabel in many other languages
- bcolz
- Feather
- Reading Microsoft Excel Files using the ExcelFile class or pandas.read_excel functin

## 3 Interacting with Web APIs

To find the last 30 GitHub issues for pandas, we can make a GET HTTP request using the add-on requests library

In [138]:
import requests

In [139]:
url = 'https://api.github.com/repos/pandas-dev/pandas/issues'

In [140]:
resp = requests.get(url)

In [141]:
resp

The Response object's `json` method will return a dict containing JSON parsed into native Python object

In [142]:
data = resp.json()

In [143]:
data[0]['title']

u'Move comparison utilities to np_datetime;'

Data is a list of dictionarys containing all of the data found on a GitHub issue page

In [145]:
issues = pd.DataFrame(data, columns=['number', 'title', 'labels', 'state'])

In [146]:
issues

,number,title,labels,state
0,18080,Move comparison utilities to np_datetime;,[],open
1,18079,DataFrameGroupBy.aggregate can not work with `...,[],open
2,18077,Shorter syntax for selecting data and expressi...,[],open
3,18074,Index tests in the wrong places,[{u'url': u'https://api.github.com/repos/panda...,open
4,18073,TST: Scipy Installation Failures on AppVeyor,[{u'url': u'https://api.github.com/repos/panda...,open
...,...,...,...,...
25,18031,AmbiguousTimeError using drop on DatetimeIndex...,[{u'url': u'https://api.github.com/repos/panda...,open
26,18030,Pandas pivot_table MultiIndex and dropna=False...,[{u'url': u'https://api.github.com/repos/panda...,open
27,18029,Specific Timestamps breaks time series indexin...,[{u'url': u'https://api.github.com/repos/panda...,open
28,18026,duplicate tests,[{u'url': u'https://api.github.com/repos/panda...,open
29,18024,.astype('object') misbehaves on Categorical co...,[{u'url': u'https://api.github.com/repos/panda...,open

## 4 Interacting with Databases

Creating a sqlite database

In [147]:
import sqlite3

In [148]:
query = """
        CREATE TABLE test
        (a VARCHAR(20), b VARCHAR(20), c REAL, d INTEGER);
        """

In [149]:
con = sqlite3.connect('mydata.sqlite')

In [150]:
con.execute(query)

In [151]:
con.commit()

Inserting a few rows of data

In [152]:
data = [('Atlanta', 'Georgia', 1.25, 6),
       ('Tallahassee', 'Florida', 2.6, 3),
       ('Sacramento', 'California', 1.7, 5)]

In [153]:
stmt = "INSERT INTO test VALUES(?, ?, ?, ?)"

In [154]:
con.executemany(stmt, data)

In [155]:
con.commit()

Selecting data from a database

In [156]:
cursor = con.execute('select * from test')

In [157]:
rows = cursor.fetchall()

In [158]:
rows

[(u'Atlanta', u'Georgia', 1.25, 6),
 (u'Tallahassee', u'Florida', 2.6, 3),
 (u'Sacramento', u'California', 1.7, 5)]

Column names are contained in the cursor's description attribute

In [160]:
cursor.description

(('a', None, None, None, None, None, None),
 ('b', None, None, None, None, None, None),
 ('c', None, None, None, None, None, None),
 ('d', None, None, None, None, None, None))

Pass the list of tuples to the DataFrame constructor

In [161]:
pd.DataFrame(rows, columns=[x[0] for x in cursor.description])

             a           b     c  d
0      Atlanta     Georgia  1.25  6
1  Tallahassee     Florida  2.60  3
2   Sacramento  California  1.70  5

Using SQLAlchemy and pandas's `read_sql` function

In [163]:
import sqlalchemy as sqla

In [164]:
db = sqla.create_engine('sqlite:///mydata.sqlite')

In [165]:
pd.read_sql('select * from test', db)

             a           b     c  d
0      Atlanta     Georgia  1.25  6
1  Tallahassee     Florida  2.60  3
2   Sacramento  California  1.70  5